CSI API ETABS v1
cCaseStaticNonlinearStaged.SetInitialCase Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetInitialCase(
	string Name,
	string InitialCase
)
Function SetInitialCase (
	Name As String,
	InitialCase As String
) As Integer
Dim instance As cCaseStaticNonlinearStaged
Dim Name As String
Dim InitialCase As String
Dim returnValue As Integer
returnValue = instance.SetInitialCase(Name,
	InitialCase)
int SetInitialCase(
	String^ Name,
	String^ InitialCase
)
abstract SetInitialCase :
        Name : string *
        InitialCase : string -> int
Parameters
Name
Type: System.String
InitialCase
Type: System.String
Return Value
Type: Int32
See Also
Reference
cCaseStaticNonlinearStaged Interface
ETABSv1 Namespace